<?xml version="1.0" ?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data element_type="f32" shape="?,50000"/>
			<rt_info>
				<attribute name="fused_names" value="input" version="0"/>
				<attribute name="old_api_map_element_type" value="f16" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="input" precision="FP32">
					<dim>-1</dim>
					<dim>50000</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_131171_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1, 1, 256" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_131171" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_130928_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="512" shape="1, 1, 1024" size="2048"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_130928" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_833" type="Const" version="opset1">
			<data element_type="i64" offset="2560" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_833" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="input.1" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="input.1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>50000</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>50000</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="wav2vec2.feature_extractor.conv_layers.0.conv.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="2568" shape="512, 1, 10" size="10240"/>
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="wav2vec2.feature_extractor.conv_layers.0.conv.weight" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="wav2vec2.feature_extractor.conv_layers.0.conv.weight" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" names="wav2vec2.feature_extractor.conv_layers.0.conv.weight" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Convolution_835" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="5"/>
			<rt_info>
				<attribute name="fused_names" value="Convolution_835" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>50000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>9999</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Reshape_855_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="12808" shape="1, 512, 1" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Reshape_855" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="onnx::Transpose_428" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_854, Reshape_855, onnx::Transpose_428" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>9999</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Transpose_428" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>9999</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_883" type="Const" version="opset1">
			<data element_type="i64" offset="13832" shape="3" size="24"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_883" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="input.3" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="input.3" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>9999</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.3" precision="FP32">
					<dim>-1</dim>
					<dim>9999</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_885" type="Const" version="opset1">
			<data element_type="i64" offset="13856" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_885" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="onnx::Mul_438" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" eps_mode="INSIDE_SQRT" normalize_variance="true"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Add_434, onnx::Div_437, onnx::Mul_438, onnx::Pow_431, onnx::ReduceMean_433, onnx::Sqrt_436, onnx::Sub_430" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>9999</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Mul_438" precision="FP32">
					<dim>-1</dim>
					<dim>9999</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_130912_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="13864" shape="1, 1, 512" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_130912" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="onnx::Add_439" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Add_439" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>9999</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Add_439" precision="FP32">
					<dim>-1</dim>
					<dim>9999</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_130913_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="14888" shape="1, 1, 512" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_130913" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="onnx::Transpose_440" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Transpose_440" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>9999</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Transpose_440" precision="FP32">
					<dim>-1</dim>
					<dim>9999</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_898" type="Const" version="opset1">
			<data element_type="i64" offset="13832" shape="3" size="24"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_898" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="onnx::Div_441" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="onnx::Div_441" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>9999</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Div_441" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>9999</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="input.7" type="Gelu" version="opset7">
			<data approximation_mode="ERF"/>
			<rt_info>
				<attribute name="fused_names" value="input.7, onnx::Add_444, onnx::Erf_443, onnx::Mul_446, onnx::Mul_447" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>9999</dim>
				</port>
			</input>
			<output>
				<port id="1" names="input.7" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>9999</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="wav2vec2.feature_extractor.conv_layers.1.conv.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="15912" shape="512, 512, 3" size="1572864"/>
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="wav2vec2.feature_extractor.conv_layers.1.conv.weight" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="wav2vec2.feature_extractor.conv_layers.1.conv.weight" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" names="wav2vec2.feature_extractor.conv_layers.1.conv.weight" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Convolution_908" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="2"/>
			<rt_info>
				<attribute name="fused_names" value="Convolution_908" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>9999</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>4999</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Reshape_928_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="1588776" shape="1, 512, 1" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Reshape_928" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="onnx::Transpose_450" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_927, Reshape_928, onnx::Transpose_450" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>4999</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Transpose_450" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>4999</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_956" type="Const" version="opset1">
			<data element_type="i64" offset="13832" shape="3" size="24"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_956" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="input.11" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="input.11" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>4999</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.11" precision="FP32">
					<dim>-1</dim>
					<dim>4999</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_958" type="Const" version="opset1">
			<data element_type="i64" offset="13856" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_958" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="onnx::Mul_460" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" eps_mode="INSIDE_SQRT" normalize_variance="true"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Add_456, onnx::Div_459, onnx::Mul_460, onnx::Pow_453, onnx::ReduceMean_455, onnx::Sqrt_458, onnx::Sub_452" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4999</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Mul_460" precision="FP32">
					<dim>-1</dim>
					<dim>4999</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_130914_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="1589800" shape="1, 1, 512" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_130914" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="onnx::Add_461" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Add_461" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4999</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Add_461" precision="FP32">
					<dim>-1</dim>
					<dim>4999</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_130915_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="1590824" shape="1, 1, 512" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_130915" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="onnx::Transpose_462" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Transpose_462" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4999</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Transpose_462" precision="FP32">
					<dim>-1</dim>
					<dim>4999</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_971" type="Const" version="opset1">
			<data element_type="i64" offset="13832" shape="3" size="24"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_971" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="onnx::Div_463" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="onnx::Div_463" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4999</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Div_463" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>4999</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="input.15" type="Gelu" version="opset7">
			<data approximation_mode="ERF"/>
			<rt_info>
				<attribute name="fused_names" value="input.15, onnx::Add_466, onnx::Erf_465, onnx::Mul_468, onnx::Mul_469" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>4999</dim>
				</port>
			</input>
			<output>
				<port id="1" names="input.15" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>4999</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="wav2vec2.feature_extractor.conv_layers.2.conv.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="1591848" shape="512, 512, 3" size="1572864"/>
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="wav2vec2.feature_extractor.conv_layers.2.conv.weight" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="wav2vec2.feature_extractor.conv_layers.2.conv.weight" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" names="wav2vec2.feature_extractor.conv_layers.2.conv.weight" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Convolution_981" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="2"/>
			<rt_info>
				<attribute name="fused_names" value="Convolution_981" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>4999</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>2499</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Reshape_1001_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="3164712" shape="1, 512, 1" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Reshape_1001" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="onnx::Transpose_472" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_1000, Reshape_1001, onnx::Transpose_472" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>2499</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Transpose_472" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>2499</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_1029" type="Const" version="opset1">
			<data element_type="i64" offset="13832" shape="3" size="24"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_1029" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="input.19" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="input.19" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>2499</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.19" precision="FP32">
					<dim>-1</dim>
					<dim>2499</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_1031" type="Const" version="opset1">
			<data element_type="i64" offset="13856" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_1031" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="onnx::Mul_482" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" eps_mode="INSIDE_SQRT" normalize_variance="true"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Add_478, onnx::Div_481, onnx::Mul_482, onnx::Pow_475, onnx::ReduceMean_477, onnx::Sqrt_480, onnx::Sub_474" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2499</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Mul_482" precision="FP32">
					<dim>-1</dim>
					<dim>2499</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_130916_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="3165736" shape="1, 1, 512" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_130916" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="onnx::Add_483" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Add_483" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2499</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Add_483" precision="FP32">
					<dim>-1</dim>
					<dim>2499</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_130917_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="3166760" shape="1, 1, 512" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_130917" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="onnx::Transpose_484" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Transpose_484" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2499</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Transpose_484" precision="FP32">
					<dim>-1</dim>
					<dim>2499</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_1044" type="Const" version="opset1">
			<data element_type="i64" offset="13832" shape="3" size="24"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_1044" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="onnx::Div_485" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="onnx::Div_485" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2499</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Div_485" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>2499</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="input.23" type="Gelu" version="opset7">
			<data approximation_mode="ERF"/>
			<rt_info>
				<attribute name="fused_names" value="input.23, onnx::Add_488, onnx::Erf_487, onnx::Mul_490, onnx::Mul_491" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>2499</dim>
				</port>
			</input>
			<output>
				<port id="1" names="input.23" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>2499</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="wav2vec2.feature_extractor.conv_layers.3.conv.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="3167784" shape="512, 512, 3" size="1572864"/>
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="wav2vec2.feature_extractor.conv_layers.3.conv.weight" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="wav2vec2.feature_extractor.conv_layers.3.conv.weight" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" names="wav2vec2.feature_extractor.conv_layers.3.conv.weight" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Convolution_1054" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="2"/>
			<rt_info>
				<attribute name="fused_names" value="Convolution_1054" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>2499</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>1249</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Reshape_1074_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="4740648" shape="1, 512, 1" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Reshape_1074" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="onnx::Transpose_494" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_1073, Reshape_1074, onnx::Transpose_494" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>1249</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Transpose_494" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>1249</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_1102" type="Const" version="opset1">
			<data element_type="i64" offset="13832" shape="3" size="24"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_1102" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="input.27" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="input.27" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>1249</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.27" precision="FP32">
					<dim>-1</dim>
					<dim>1249</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_1104" type="Const" version="opset1">
			<data element_type="i64" offset="13856" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_1104" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="onnx::Mul_504" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" eps_mode="INSIDE_SQRT" normalize_variance="true"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Add_500, onnx::Div_503, onnx::Mul_504, onnx::Pow_497, onnx::ReduceMean_499, onnx::Sqrt_502, onnx::Sub_496" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1249</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Mul_504" precision="FP32">
					<dim>-1</dim>
					<dim>1249</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_130918_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="4741672" shape="1, 1, 512" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_130918" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="onnx::Add_505" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Add_505" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1249</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Add_505" precision="FP32">
					<dim>-1</dim>
					<dim>1249</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_130919_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="4742696" shape="1, 1, 512" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_130919" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="onnx::Transpose_506" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Transpose_506" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1249</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Transpose_506" precision="FP32">
					<dim>-1</dim>
					<dim>1249</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_1117" type="Const" version="opset1">
			<data element_type="i64" offset="13832" shape="3" size="24"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_1117" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="onnx::Div_507" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="onnx::Div_507" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1249</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Div_507" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>1249</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="input.31" type="Gelu" version="opset7">
			<data approximation_mode="ERF"/>
			<rt_info>
				<attribute name="fused_names" value="input.31, onnx::Add_510, onnx::Erf_509, onnx::Mul_512, onnx::Mul_513" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>1249</dim>
				</port>
			</input>
			<output>
				<port id="1" names="input.31" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>1249</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="wav2vec2.feature_extractor.conv_layers.4.conv.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="4743720" shape="512, 512, 3" size="1572864"/>
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="wav2vec2.feature_extractor.conv_layers.4.conv.weight" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="wav2vec2.feature_extractor.conv_layers.4.conv.weight" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" names="wav2vec2.feature_extractor.conv_layers.4.conv.weight" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Convolution_1127" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="2"/>
			<rt_info>
				<attribute name="fused_names" value="Convolution_1127" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>1249</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>624</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Reshape_1147_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="6316584" shape="1, 512, 1" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Reshape_1147" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="onnx::Transpose_516" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_1146, Reshape_1147, onnx::Transpose_516" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>624</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Transpose_516" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>624</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_1175" type="Const" version="opset1">
			<data element_type="i64" offset="13832" shape="3" size="24"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_1175" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="input.35" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="input.35" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>624</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.35" precision="FP32">
					<dim>-1</dim>
					<dim>624</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_1177" type="Const" version="opset1">
			<data element_type="i64" offset="13856" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_1177" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="onnx::Mul_526" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" eps_mode="INSIDE_SQRT" normalize_variance="true"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Add_522, onnx::Div_525, onnx::Mul_526, onnx::Pow_519, onnx::ReduceMean_521, onnx::Sqrt_524, onnx::Sub_518" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>624</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Mul_526" precision="FP32">
					<dim>-1</dim>
					<dim>624</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_130920_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="6317608" shape="1, 1, 512" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_130920" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="onnx::Add_527" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Add_527" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>624</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Add_527" precision="FP32">
					<dim>-1</dim>
					<dim>624</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_130921_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="6318632" shape="1, 1, 512" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_130921" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="onnx::Transpose_528" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Transpose_528" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>624</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Transpose_528" precision="FP32">
					<dim>-1</dim>
					<dim>624</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_1190" type="Const" version="opset1">
			<data element_type="i64" offset="13832" shape="3" size="24"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_1190" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="onnx::Div_529" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="onnx::Div_529" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>624</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Div_529" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>624</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="input.39" type="Gelu" version="opset7">
			<data approximation_mode="ERF"/>
			<rt_info>
				<attribute name="fused_names" value="input.39, onnx::Add_532, onnx::Erf_531, onnx::Mul_534, onnx::Mul_535" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>624</dim>
				</port>
			</input>
			<output>
				<port id="1" names="input.39" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>624</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="wav2vec2.feature_extractor.conv_layers.5.conv.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="6319656" shape="512, 512, 2" size="1048576"/>
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="wav2vec2.feature_extractor.conv_layers.5.conv.weight" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="wav2vec2.feature_extractor.conv_layers.5.conv.weight" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" names="wav2vec2.feature_extractor.conv_layers.5.conv.weight" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Convolution_1200" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="2"/>
			<rt_info>
				<attribute name="fused_names" value="Convolution_1200" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>624</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>312</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Reshape_1220_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="7368232" shape="1, 512, 1" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Reshape_1220" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
